export const RESERVATION_LIST = [
  {
    name: '김성용',
    phone: '010-1234-1234',
    number: '1234-1234-1234',
  },
  {
    name: '이효진',
    phone: '010-1111-1111',
    number: '1111-1111-1111',
  },
  {
    name: '김성용',
    phone: '010-2222-2222',
    number: '2222-2222-2222',
  },
  {
    name: '김태기',
    phone: '010-3333-3333',
    number: '3333-3333-3333',
  },
  {
    name: '박선영',
    phone: '010-4444-4444',
    number: '4444-4444-4444',
  },
  {
    name: '예은선',
    phone: '010-5555-5555',
    number: '5555-5555-5555',
  },
  {
    name: '이주람',
    phone: '010-6666-6666',
    number: '6666-6666-6666',
  },
  {
    name: '김성용',
    phone: '010-7777-7777',
    number: '7777-7777-7777',
  },
  {
    name: '조아연',
    phone: '010-8888-8888',
    number: '8888-8888-8888',
  },
  {
    name: '김나실',
    phone: '010-9999-9999',
    number: '9999-9999-9999',
  },
  {
    name: '구현서',
    phone: '010-0000-0000',
    number: '0000-0000-0000',
  },
];
